[
  {
    "company": "Previdenciarista",
    "companyLogoUrl": "/assets/companies-logos/previdenciarista.jpeg",
    "employmentType": "Full-time",
    "title": "Senior Software Engineer",
    "description": "<p>I am responsible for maintaining applications to the highest standards and ensuring stability for our 22,000+ active customers on the platform, enabling them to perform pension calculations and more. Additionally, I oversee the main website, ensuring it achieves the highest levels of SEO and performance. I enhanced the website's performance by 22%, improved SEO by approximately 9%, and implemented good practices, resulting in a 29% enhancement.</p><ul><li><b>Feature development:</b> Development of new features using Next, HTML, Tailwind CSS, Typescript and React Hooks;</li><li><b>SEO improvement: </b>Implementation of SEO techniques using Google Analytics and Google Tag Manager;</li><li><b>Bug fixes:</b> Bug-fixing initiatives, enhancing software reliability and user satisfaction;</li><li><b>Code refactoring:</b> I am responsible to reduce tones of code lines, increasing development experience and improving the efficiency.</li></ul>",
    "startedAt": "2023-12-01"
  },
  {
    "company": "Escola Conquer",
    "companyLogoUrl": "/assets/companies-logos/conquer.jpeg",
    "employmentType": "Full-time",
    "startedAt": "2021-09-01",
    "endedAt": "2023-09-01",
    "positions": [
      {
        "title": "Senior Software Engineer",
        "startedAt": "2022-10-01",
        "endedAt": "2023-09-01",
        "description": "<p>As the Lead Software Engineer, I spearheaded the development of the Conquer Plus Platform, a project that has significantly impacted over 2 million customers globally by issuing more than 1 million certificates. My role was pivotal in every phase of the platform's lifecycle, from the initial planning stages to the selection of cutting-edge technologies and the architecture of the entire system.</p><ul><li><b>Public Speaking:</b> Delivered insightful presentations on key technical topics, establishing thought leadership within and beyond the team.</li><li><b>Team Support:</b> Provided ongoing support and mentorship to team members, enhancing team cohesion and individual skill levels.</li><li><b>Content Creation:</b> Authored engaging programming course content, contributing to the development and dissemination of technical knowledge.</li><li><b>Development and Training:</b> Spearheaded the upskilling of team members in both technical and soft skills, fostering a collaborative and high-performing team environment.</li><li><b>Feature Development:</b> Led the design and implementation of new features, significantly enhancing platform functionality and user experience.</li><li><b>Bug Fixes:</b> Directed effective bug resolution efforts, substantially improving software reliability and performance.</li></ul>"
      },
      {
        "title": "Software Engineer",
        "startedAt": "2021-10-01",
        "endedAt": "2022-10-01",
        "description": "<p>I drove comprehensive enhancements in both technology and team capabilities, significantly boosting platform performance and fostering a culture of continuous learning and innovation.</p><ul><li><b>Feature Development:</b> Design and implementation of new features, significantly enhancing platform functionality and user experience.</li><li><b>Bug Fixes:</b> Directed effective bug resolution efforts, substantially improving software reliability and performance.</li><li><b>Platform Improvements:</b> Implemented strategic enhancements to the Conquer Plus platform, optimizing operational efficiency and user satisfaction.</li><li><b>Performance Optimization:</b> Engineered and deployed code optimizations, markedly boosting the platform's performance and scalability.</li><li><b>Documentation:</b> Produced comprehensive code documentation, ensuring maintainability and easing future development efforts.</li></ul>"
      }
    ]
  },
  {
    "company": "Amank",
    "companyLogoUrl": "/assets/companies-logos/amank.jpeg",
    "employmentType": "Self-employed",
    "title": "Co-Founder & Senior Software Engineer",
    "description": "<p>I focused on maximizing usability, performance, and code excellence, in line with our mission to make business operations simpler and prioritize quality growth. Our efforts led to successful investment rounds and the strategic sale of the company.</p><ul><li><b>New Features Development:</b> Led the development of over 20 new features, significantly enhancing platform functionality and user satisfaction.</li><li><b>Bug Fixes:</b> Directed the resolution of bugs, ensuring optimal platform reliability and enhancing user experience, reducing bugs to zero.</li><li><b>Software Architecture Planning:</b> Managed the planning and design of the software architecture to ensure scalability and performance, developing a system that supported a 100% increase in user load without performance compromise.</li><li><b>Performance Improvement Coding:</b> Spearheaded code optimizations to enhance platform efficiency and user experience, achieving a almost 70% improvement in platform load.</li></ul>",
    "startedAt": "2022-08-01",
    "endedAt": "2023-05-01"
  },
  {
    "company": "Dobank",
    "companyLogoUrl": "/assets/companies-logos/dobank.jpeg",
    "employmentType": "Freelance",
    "title": "Software Engineer",
    "description": "<p>Performance Improvement Coding: Spearheaded code optimizations to enhance platform efficiency and user experience, achieving a almost 70% improvement in platform load.</p><ul><li><b>App Development and Feature Creation:</b> Pioneered the entire app development, crafting its core features and architecture, which led to a robust platform with enhanced user engagement and satisfaction.</li><li><b>Screen Development:</b> Implementation of all app screens, focusing on intuitive user interfaces and seamless navigation.</li><li><b>API Consumption with GraphQL:</b> Engineered the app's data management system using GraphQL, optimizing performance and data retrieval.</li></ul>",
    "startedAt": "2021-06-01",
    "endedAt": "2022-09-01"
  },
  {
    "company": "Chamer",
    "companyLogoUrl": "/assets/companies-logos/chamer.jpeg",
    "employmentType": "Freelance",
    "title": "Front-end Developer",
    "description": "<ul><li>Develop applications using React and Next JS</li><li>Refactoring codes using JavaScript TypeScript</li></ul>",
    "startedAt": "2021-03-01",
    "endedAt": "2021-09-01"
  },
  {
    "company": "WebCorp Br",
    "companyLogoUrl": "/assets/companies-logos/webcorp.jpeg",
    "employmentType": "Self-employed",
    "title": "CTO & Co-Founder",
    "description": "<ul><li>Project's organization</li><li>People and process handling</li><li>Application development in React.js and Node.js</li><li>DevOps</li></ul>",
    "startedAt": "2020-11-01",
    "endedAt": "2021-02-01"
  },
  {
    "company": "WebTrip",
    "companyLogoUrl": "/assets/companies-logos/webtrip.jpeg",
    "employmentType": "Part-time",
    "startedAt": "2019-02-01",
    "endedAt": "2020-11-01",
    "positions": [
      {
        "title": "Junior Full-stack Developer",
        "startedAt": "2020-01-01",
        "endedAt": "2020-11-01",
        "description": "<ul><li>Servers maintenance</li><li>Advanced spreadsheet automation and development using Google Scripts</li><li>Implementation, management and maintenance of telephone lines, IVR and extensions</li><li>Implementation of improvements in the Front and Back-end of the company's websites</li><li>Improvement of internal processes</li><li>Suite CRM development and maintenance</li></ul>"
      },
      {
        "title": "Financial Assistant",
        "startedAt": "2019-02-01",
        "endedAt": "2020-01-01",
        "description": "<ul><li>Accounts Receivable</li><li>Accounts Payable</li><li>Advanced knowledge in WinTour Software</li><li>Customer service</li><li>Issuance and analysis of basic financial reports</li></ul>"
      }
    ]
  }
]
